InnoDBVsMyRocks/sysbench-tpcc/4t_1h_s200_v2_innodb/sb.out
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 10.69 qps: 320.03 (r/w/o: 145.62/151.42/22.99) lat (ms,95%): 1258.08 err/s 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 12.40 qps: 366.99 (r/w/o: 167.94/174.24/24.81) lat (ms,95%): 1170.65 err/s 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 13.10 qps: 361.64 (r/w/o: 164.37/171.07/26.20) lat (ms,95%): 1129.24 err/s 0.10 reconn/s: 0.00
[ 40s ] thds: 4 tps: 14.10 qps: 384.87 (r/w/o: 176.09/180.59/28.20) lat (ms,95%): 943.16 err/s 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 14.81 qps: 404.05 (r/w/o: 184.07/190.37/29.61) lat (ms,95%): 1032.01 err/s 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 15.30 qps: 415.19 (r/w/o: 187.65/196.95/30.59) lat (ms,95%): 1069.86 err/s 0.10 reconn/s: 0.00
[ 70s ] thds: 4 tps: 14.50 qps: 388.90 (r/w/o: 176.75/183.15/29.01) lat (ms,95%): 1191.92 err/s 0.30 reconn/s: 0.00
[ 80s ] thds: 4 tps: 15.50 qps: 446.91 (r/w/o: 203.36/212.56/30.99) lat (ms,95%): 909.80 err/s 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 20.80 qps: 558.80 (r/w/o: 254.75/262.45/41.61) lat (ms,95%): 977.74 err/s 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 21.00 qps: 621.64 (r/w/o: 286.87/292.77/42.00) lat (ms,95%): 877.61 err/s 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 20.30 qps: 575.87 (r/w/o: 262.83/272.43/40.60) lat (ms,95%): 909.80 err/s 0.10 reconn/s: 0.00
[ 120s ] thds: 4 tps: 20.70 qps: 615.05 (r/w/o: 280.68/292.98/41.40) lat (ms,95%): 977.74 err/s 0.40 reconn/s: 0.00
[ 130s ] thds: 4 tps: 22.80 qps: 607.94 (r/w/o: 276.57/285.87/45.50) lat (ms,95%): 831.46 err/s 0.00 reconn/s: 0.00
[ 140s ] thds: 4 tps: 20.20 qps: 536.06 (r/w/o: 242.23/253.33/40.50) lat (ms,95%): 943.16 err/s 0.00 reconn/s: 0.00
[ 150s ] thds: 4 tps: 21.90 qps: 671.57 (r/w/o: 307.89/319.88/43.80) lat (ms,95%): 831.46 err/s 0.10 reconn/s: 0.00
[ 160s ] thds: 4 tps: 23.40 qps: 651.70 (r/w/o: 295.80/309.10/46.80) lat (ms,95%): 802.05 err/s 0.10 reconn/s: 0.00
[ 170s ] thds: 4 tps: 21.40 qps: 577.18 (r/w/o: 264.19/270.19/42.80) lat (ms,95%): 909.80 err/s 0.20 reconn/s: 0.00
[ 180s ] thds: 4 tps: 28.21 qps: 753.34 (r/w/o: 343.47/353.47/56.41) lat (ms,95%): 248.83 err/s 0.20 reconn/s: 0.00
[ 190s ] thds: 4 tps: 27.30 qps: 735.92 (r/w/o: 334.16/347.16/54.59) lat (ms,95%): 657.93 err/s 0.00 reconn/s: 0.00
[ 200s ] thds: 4 tps: 29.70 qps: 840.04 (r/w/o: 383.82/396.82/59.40) lat (ms,95%): 325.98 err/s 0.30 reconn/s: 0.00
[ 210s ] thds: 4 tps: 14.00 qps: 388.71 (r/w/o: 177.60/183.10/28.00) lat (ms,95%): 995.51 err/s 0.10 reconn/s: 0.00
[ 220s ] thds: 4 tps: 23.50 qps: 646.82 (r/w/o: 296.16/303.66/46.99) lat (ms,95%): 861.95 err/s 0.10 reconn/s: 0.00
[ 230s ] thds: 4 tps: 28.90 qps: 812.38 (r/w/o: 368.84/385.74/57.81) lat (ms,95%): 657.93 err/s 0.10 reconn/s: 0.00
[ 240s ] thds: 4 tps: 26.30 qps: 792.93 (r/w/o: 362.71/377.61/52.60) lat (ms,95%): 759.88 err/s 0.00 reconn/s: 0.00
[ 250s ] thds: 4 tps: 33.39 qps: 1008.64 (r/w/o: 463.63/478.22/66.79) lat (ms,95%): 219.36 err/s 0.20 reconn/s: 0.00
[ 260s ] thds: 4 tps: 28.00 qps: 758.01 (r/w/o: 346.15/355.85/56.01) lat (ms,95%): 787.74 err/s 0.00 reconn/s: 0.00
[ 270s ] thds: 4 tps: 35.60 qps: 992.11 (r/w/o: 451.66/469.26/71.19) lat (ms,95%): 240.02 err/s 0.00 reconn/s: 0.00
[ 280s ] thds: 4 tps: 30.30 qps: 893.30 (r/w/o: 408.10/424.60/60.60) lat (ms,95%): 623.33 err/s 0.10 reconn/s: 0.00
[ 290s ] thds: 4 tps: 34.20 qps: 999.95 (r/w/o: 452.52/479.02/68.40) lat (ms,95%): 363.18 err/s 0.10 reconn/s: 0.00
[ 300s ] thds: 4 tps: 33.20 qps: 967.34 (r/w/o: 439.82/461.12/66.40) lat (ms,95%): 235.74 err/s 0.30 reconn/s: 0.00
[ 310s ] thds: 4 tps: 34.60 qps: 1017.50 (r/w/o: 462.90/485.40/69.20) lat (ms,95%): 244.38 err/s 0.20 reconn/s: 0.00
[ 320s ] thds: 4 tps: 32.70 qps: 922.45 (r/w/o: 418.68/438.38/65.40) lat (ms,95%): 376.49 err/s 0.30 reconn/s: 0.00
[ 330s ] thds: 4 tps: 31.30 qps: 900.05 (r/w/o: 409.82/427.62/62.60) lat (ms,95%): 337.94 err/s 0.00 reconn/s: 0.00
[ 340s ] thds: 4 tps: 28.40 qps: 834.62 (r/w/o: 380.66/397.16/56.79) lat (ms,95%): 287.38 err/s 0.10 reconn/s: 0.00
[ 350s ] thds: 4 tps: 27.70 qps: 755.31 (r/w/o: 342.20/357.70/55.40) lat (ms,95%): 350.33 err/s 0.00 reconn/s: 0.00
[ 360s ] thds: 4 tps: 27.70 qps: 727.19 (r/w/o: 332.94/338.84/55.41) lat (ms,95%): 404.61 err/s 0.10 reconn/s: 0.00
[ 370s ] thds: 4 tps: 24.70 qps: 691.91 (r/w/o: 313.06/329.46/49.39) lat (ms,95%): 434.83 err/s 0.00 reconn/s: 0.00
[ 380s ] thds: 4 tps: 24.10 qps: 667.60 (r/w/o: 304.35/315.05/48.21) lat (ms,95%): 376.49 err/s 0.00 reconn/s: 0.00
[ 390s ] thds: 4 tps: 21.90 qps: 608.32 (r/w/o: 276.67/287.86/43.79) lat (ms,95%): 646.19 err/s 0.20 reconn/s: 0.00
[ 400s ] thds: 4 tps: 19.80 qps: 578.91 (r/w/o: 265.00/274.30/39.60) lat (ms,95%): 893.56 err/s 0.10 reconn/s: 0.00
[ 410s ] thds: 4 tps: 27.40 qps: 831.22 (r/w/o: 380.31/396.11/54.80) lat (ms,95%): 331.91 err/s 0.10 reconn/s: 0.00
[ 420s ] thds: 4 tps: 26.50 qps: 749.43 (r/w/o: 343.07/353.37/53.00) lat (ms,95%): 303.33 err/s 0.20 reconn/s: 0.00
[ 430s ] thds: 4 tps: 27.40 qps: 728.82 (r/w/o: 335.07/338.96/54.79) lat (ms,95%): 356.70 err/s 0.20 reconn/s: 0.00
[ 440s ] thds: 4 tps: 22.30 qps: 601.71 (r/w/o: 274.55/282.55/44.61) lat (ms,95%): 601.29 err/s 0.10 reconn/s: 0.00
[ 450s ] thds: 4 tps: 26.10 qps: 759.96 (r/w/o: 346.88/360.88/52.20) lat (ms,95%): 308.84 err/s 0.00 reconn/s: 0.00
[ 460s ] thds: 4 tps: 24.90 qps: 688.86 (r/w/o: 313.83/325.23/49.80) lat (ms,95%): 530.08 err/s 0.10 reconn/s: 0.00
[ 470s ] thds: 4 tps: 23.30 qps: 655.16 (r/w/o: 299.88/308.68/46.60) lat (ms,95%): 442.73 err/s 0.40 reconn/s: 0.00
[ 480s ] thds: 4 tps: 24.90 qps: 718.36 (r/w/o: 331.33/337.23/49.80) lat (ms,95%): 356.70 err/s 0.20 reconn/s: 0.00
[ 490s ] thds: 4 tps: 22.30 qps: 619.92 (r/w/o: 284.51/290.81/44.60) lat (ms,95%): 746.32 err/s 0.10 reconn/s: 0.00
[ 500s ] thds: 4 tps: 27.10 qps: 721.72 (r/w/o: 330.96/336.56/54.19) lat (ms,95%): 356.70 err/s 0.00 reconn/s: 0.00
[ 510s ] thds: 4 tps: 17.90 qps: 514.86 (r/w/o: 234.13/244.93/35.79) lat (ms,95%): 1050.76 err/s 0.00 reconn/s: 0.00
[ 520s ] thds: 4 tps: 22.81 qps: 600.64 (r/w/o: 276.71/278.31/45.62) lat (ms,95%): 707.07 err/s 0.10 reconn/s: 0.00
[ 530s ] thds: 4 tps: 23.00 qps: 653.37 (r/w/o: 296.99/310.39/46.00) lat (ms,95%): 909.80 err/s 0.10 reconn/s: 0.00
[ 540s ] thds: 4 tps: 25.70 qps: 714.93 (r/w/o: 327.77/335.76/51.39) lat (ms,95%): 369.77 err/s 0.10 reconn/s: 0.00
[ 550s ] thds: 4 tps: 30.70 qps: 850.55 (r/w/o: 388.32/400.82/61.40) lat (ms,95%): 287.38 err/s 0.10 reconn/s: 0.00
[ 560s ] thds: 4 tps: 22.30 qps: 629.09 (r/w/o: 288.40/296.10/44.60) lat (ms,95%): 861.95 err/s 0.00 reconn/s: 0.00
[ 570s ] thds: 4 tps: 26.80 qps: 790.65 (r/w/o: 358.98/378.08/53.60) lat (ms,95%): 450.77 err/s 0.10 reconn/s: 0.00
[ 580s ] thds: 4 tps: 24.50 qps: 739.57 (r/w/o: 335.58/354.98/49.00) lat (ms,95%): 493.24 err/s 0.00 reconn/s: 0.00
[ 590s ] thds: 4 tps: 39.50 qps: 1061.21 (r/w/o: 479.05/503.15/79.01) lat (ms,95%): 204.11 err/s 0.30 reconn/s: 0.00
[ 600s ] thds: 4 tps: 30.90 qps: 805.03 (r/w/o: 365.37/377.87/61.79) lat (ms,95%): 530.08 err/s 0.00 reconn/s: 0.00
[ 610s ] thds: 4 tps: 32.50 qps: 966.00 (r/w/o: 439.55/461.45/65.01) lat (ms,95%): 287.38 err/s 0.40 reconn/s: 0.00
[ 620s ] thds: 4 tps: 32.40 qps: 964.93 (r/w/o: 445.47/454.66/64.79) lat (ms,95%): 262.64 err/s 0.20 reconn/s: 0.00
[ 630s ] thds: 4 tps: 33.90 qps: 956.90 (r/w/o: 436.44/452.65/67.81) lat (ms,95%): 235.74 err/s 0.00 reconn/s: 0.00
[ 640s ] thds: 4 tps: 32.60 qps: 932.67 (r/w/o: 426.69/440.79/65.20) lat (ms,95%): 363.18 err/s 0.00 reconn/s: 0.00
[ 650s ] thds: 4 tps: 37.10 qps: 1108.97 (r/w/o: 510.19/524.59/74.20) lat (ms,95%): 186.54 err/s 0.20 reconn/s: 0.00
[ 660s ] thds: 4 tps: 36.00 qps: 1033.10 (r/w/o: 472.74/488.35/72.01) lat (ms,95%): 215.44 err/s 0.10 reconn/s: 0.00
[ 670s ] thds: 4 tps: 36.29 qps: 1074.86 (r/w/o: 490.89/511.39/72.58) lat (ms,95%): 211.60 err/s 0.30 reconn/s: 0.00
[ 680s ] thds: 4 tps: 31.30 qps: 917.51 (r/w/o: 416.51/438.41/62.60) lat (ms,95%): 331.91 err/s 0.00 reconn/s: 0.00
[ 690s ] thds: 4 tps: 34.71 qps: 941.75 (r/w/o: 428.17/444.17/69.41) lat (ms,95%): 297.92 err/s 0.20 reconn/s: 0.00
[ 700s ] thds: 4 tps: 36.70 qps: 979.22 (r/w/o: 447.06/458.76/73.39) lat (ms,95%): 211.60 err/s 0.10 reconn/s: 0.00
[ 710s ] thds: 4 tps: 35.50 qps: 1010.13 (r/w/o: 463.82/475.32/71.00) lat (ms,95%): 244.38 err/s 0.40 reconn/s: 0.00
[ 720s ] thds: 4 tps: 32.00 qps: 818.89 (r/w/o: 374.95/379.95/63.99) lat (ms,95%): 262.64 err/s 0.00 reconn/s: 0.00
[ 730s ] thds: 4 tps: 34.71 qps: 1034.47 (r/w/o: 472.98/492.08/69.41) lat (ms,95%): 303.33 err/s 0.20 reconn/s: 0.00
[ 740s ] thds: 4 tps: 33.50 qps: 927.50 (r/w/o: 424.10/436.40/67.00) lat (ms,95%): 235.74 err/s 0.20 reconn/s: 0.00
[ 750s ] thds: 4 tps: 33.50 qps: 964.06 (r/w/o: 440.43/456.63/67.00) lat (ms,95%): 344.08 err/s 0.40 reconn/s: 0.00
[ 760s ] thds: 4 tps: 32.89 qps: 946.75 (r/w/o: 431.33/449.63/65.79) lat (ms,95%): 227.40 err/s 0.00 reconn/s: 0.00
[ 770s ] thds: 4 tps: 34.81 qps: 1045.10 (r/w/o: 477.89/497.60/69.61) lat (ms,95%): 287.38 err/s 0.00 reconn/s: 0.00
[ 780s ] thds: 4 tps: 28.70 qps: 782.97 (r/w/o: 357.79/367.79/57.40) lat (ms,95%): 816.63 err/s 0.20 reconn/s: 0.00
[ 790s ] thds: 4 tps: 36.80 qps: 1059.31 (r/w/o: 486.26/499.46/73.59) lat (ms,95%): 196.89 err/s 0.40 reconn/s: 0.00
[ 800s ] thds: 4 tps: 37.30 qps: 1072.58 (r/w/o: 489.49/508.49/74.60) lat (ms,95%): 207.82 err/s 0.30 reconn/s: 0.00
[ 810s ] thds: 4 tps: 38.30 qps: 1048.80 (r/w/o: 479.85/492.35/76.61) lat (ms,95%): 204.11 err/s 0.10 reconn/s: 0.00
[ 820s ] thds: 4 tps: 39.40 qps: 1207.99 (r/w/o: 551.49/577.69/78.80) lat (ms,95%): 204.11 err/s 0.30 reconn/s: 0.00
[ 830s ] thds: 4 tps: 35.50 qps: 957.38 (r/w/o: 437.29/449.09/71.00) lat (ms,95%): 235.74 err/s 0.10 reconn/s: 0.00
[ 840s ] thds: 4 tps: 38.10 qps: 1013.99 (r/w/o: 462.79/474.99/76.20) lat (ms,95%): 200.47 err/s 0.10 reconn/s: 0.00
[ 850s ] thds: 4 tps: 39.30 qps: 1082.40 (r/w/o: 495.15/508.65/78.59) lat (ms,95%): 207.82 err/s 0.20 reconn/s: 0.00
[ 860s ] thds: 4 tps: 32.70 qps: 904.84 (r/w/o: 410.06/429.36/65.41) lat (ms,95%): 442.73 err/s 0.00 reconn/s: 0.00
[ 870s ] thds: 4 tps: 39.40 qps: 1204.08 (r/w/o: 551.19/574.09/78.80) lat (ms,95%): 193.38 err/s 0.20 reconn/s: 0.00
[ 880s ] thds: 4 tps: 36.10 qps: 1074.65 (r/w/o: 491.28/511.18/72.20) lat (ms,95%): 350.33 err/s 0.10 reconn/s: 0.00
[ 890s ] thds: 4 tps: 36.40 qps: 1082.69 (r/w/o: 495.84/514.04/72.81) lat (ms,95%): 211.60 err/s 0.00 reconn/s: 0.00
[ 900s ] thds: 4 tps: 36.80 qps: 1020.96 (r/w/o: 464.78/482.58/73.60) lat (ms,95%): 240.02 err/s 0.00 reconn/s: 0.00
[ 910s ] thds: 4 tps: 38.99 qps: 1130.14 (r/w/o: 518.38/533.78/77.98) lat (ms,95%): 211.60 err/s 0.30 reconn/s: 0.00
[ 920s ] thds: 4 tps: 29.51 qps: 870.76 (r/w/o: 400.87/410.88/59.01) lat (ms,95%): 590.56 err/s 0.30 reconn/s: 0.00
[ 930s ] thds: 4 tps: 37.70 qps: 1081.80 (r/w/o: 495.20/511.20/75.40) lat (ms,95%): 223.34 err/s 0.10 reconn/s: 0.00
[ 940s ] thds: 4 tps: 33.30 qps: 956.68 (r/w/o: 439.43/450.64/66.61) lat (ms,95%): 303.33 err/s 0.40 reconn/s: 0.00
[ 950s ] thds: 4 tps: 27.50 qps: 830.95 (r/w/o: 381.68/394.28/55.00) lat (ms,95%): 539.71 err/s 0.30 reconn/s: 0.00
[ 960s ] thds: 4 tps: 45.00 qps: 1300.58 (r/w/o: 594.64/615.94/90.01) lat (ms,95%): 186.54 err/s 0.20 reconn/s: 0.00
[ 970s ] thds: 4 tps: 35.60 qps: 983.58 (r/w/o: 452.29/460.09/71.20) lat (ms,95%): 189.93 err/s 0.50 reconn/s: 0.00
[ 980s ] thds: 4 tps: 37.20 qps: 1005.27 (r/w/o: 456.69/474.19/74.40) lat (ms,95%): 207.82 err/s 0.10 reconn/s: 0.00
[ 990s ] thds: 4 tps: 32.90 qps: 903.54 (r/w/o: 412.72/425.02/65.80) lat (ms,95%): 549.52 err/s 0.20 reconn/s: 0.00
[ 1000s ] thds: 4 tps: 40.00 qps: 1173.47 (r/w/o: 536.89/556.59/80.00) lat (ms,95%): 215.44 err/s 0.20 reconn/s: 0.00
[ 1010s ] thds: 4 tps: 41.80 qps: 1179.43 (r/w/o: 540.77/555.06/83.59) lat (ms,95%): 189.93 err/s 0.20 reconn/s: 0.00
[ 1020s ] thds: 4 tps: 39.20 qps: 1113.17 (r/w/o: 508.63/526.23/78.31) lat (ms,95%): 227.40 err/s 0.30 reconn/s: 0.00
[ 1030s ] thds: 4 tps: 34.00 qps: 979.86 (r/w/o: 446.68/465.08/68.10) lat (ms,95%): 325.98 err/s 0.20 reconn/s: 0.00
[ 1040s ] thds: 4 tps: 38.30 qps: 1134.08 (r/w/o: 519.54/537.94/76.61) lat (ms,95%): 235.74 err/s 0.20 reconn/s: 0.00
[ 1050s ] thds: 4 tps: 37.00 qps: 950.40 (r/w/o: 434.45/441.95/73.99) lat (ms,95%): 235.74 err/s 0.00 reconn/s: 0.00
[ 1060s ] thds: 4 tps: 38.50 qps: 1081.78 (r/w/o: 493.74/511.04/76.99) lat (ms,95%): 215.44 err/s 0.30 reconn/s: 0.00
[ 1070s ] thds: 4 tps: 36.20 qps: 1007.75 (r/w/o: 460.42/474.92/72.40) lat (ms,95%): 244.38 err/s 0.40 reconn/s: 0.00
[ 1080s ] thds: 4 tps: 40.31 qps: 1108.64 (r/w/o: 505.36/522.67/80.61) lat (ms,95%): 204.11 err/s 0.00 reconn/s: 0.00
[ 1090s ] thds: 4 tps: 34.90 qps: 1009.29 (r/w/o: 462.10/477.40/69.80) lat (ms,95%): 277.21 err/s 0.20 reconn/s: 0.00
[ 1100s ] thds: 4 tps: 33.60 qps: 953.88 (r/w/o: 435.99/450.69/67.20) lat (ms,95%): 287.38 err/s 0.10 reconn/s: 0.00
[ 1110s ] thds: 4 tps: 47.00 qps: 1362.41 (r/w/o: 621.46/646.96/93.99) lat (ms,95%): 173.58 err/s 0.40 reconn/s: 0.00
[ 1120s ] thds: 4 tps: 39.20 qps: 1174.69 (r/w/o: 533.94/562.34/78.41) lat (ms,95%): 207.82 err/s 0.40 reconn/s: 0.00
[ 1130s ] thds: 4 tps: 38.30 qps: 1006.43 (r/w/o: 459.32/470.52/76.60) lat (ms,95%): 248.83 err/s 0.10 reconn/s: 0.00
[ 1140s ] thds: 4 tps: 38.30 qps: 1107.13 (r/w/o: 503.91/526.62/76.60) lat (ms,95%): 227.40 err/s 0.00 reconn/s: 0.00
[ 1150s ] thds: 4 tps: 37.20 qps: 1090.63 (r/w/o: 496.67/519.57/74.40) lat (ms,95%): 227.40 err/s 0.10 reconn/s: 0.00
[ 1160s ] thds: 4 tps: 33.00 qps: 941.46 (r/w/o: 426.88/448.58/66.00) lat (ms,95%): 272.27 err/s 0.00 reconn/s: 0.00
[ 1170s ] thds: 4 tps: 35.10 qps: 977.72 (r/w/o: 445.26/462.26/70.19) lat (ms,95%): 253.35 err/s 0.20 reconn/s: 0.00
[ 1180s ] thds: 4 tps: 34.30 qps: 980.59 (r/w/o: 447.04/464.94/68.61) lat (ms,95%): 235.74 err/s 0.10 reconn/s: 0.00
[ 1190s ] thds: 4 tps: 37.30 qps: 1144.27 (r/w/o: 521.63/548.03/74.60) lat (ms,95%): 231.53 err/s 0.40 reconn/s: 0.00
[ 1200s ] thds: 4 tps: 39.40 qps: 1187.68 (r/w/o: 543.19/565.69/78.80) lat (ms,95%): 211.60 err/s 0.00 reconn/s: 0.00
[ 1210s ] thds: 4 tps: 40.30 qps: 1097.65 (r/w/o: 501.18/515.87/80.60) lat (ms,95%): 207.82 err/s 0.20 reconn/s: 0.00
[ 1220s ] thds: 4 tps: 39.10 qps: 1066.90 (r/w/o: 486.00/502.70/78.20) lat (ms,95%): 227.40 err/s 0.30 reconn/s: 0.00
[ 1230s ] thds: 4 tps: 35.60 qps: 969.14 (r/w/o: 441.67/456.27/71.20) lat (ms,95%): 244.38 err/s 0.20 reconn/s: 0.00
[ 1240s ] thds: 4 tps: 40.50 qps: 1142.70 (r/w/o: 521.55/540.15/81.01) lat (ms,95%): 196.89 err/s 0.10 reconn/s: 0.00
[ 1250s ] thds: 4 tps: 31.70 qps: 804.39 (r/w/o: 366.70/374.30/63.40) lat (ms,95%): 350.33 err/s 0.10 reconn/s: 0.00
[ 1260s ] thds: 4 tps: 29.90 qps: 891.15 (r/w/o: 408.38/422.97/59.80) lat (ms,95%): 458.96 err/s 0.10 reconn/s: 0.00
[ 1270s ] thds: 4 tps: 38.21 qps: 1095.17 (r/w/o: 500.88/517.88/76.41) lat (ms,95%): 235.74 err/s 0.20 reconn/s: 0.00
[ 1280s ] thds: 4 tps: 38.10 qps: 1094.61 (r/w/o: 499.56/518.86/76.19) lat (ms,95%): 227.40 err/s 0.00 reconn/s: 0.00
[ 1290s ] thds: 4 tps: 42.70 qps: 1265.16 (r/w/o: 572.73/607.03/85.40) lat (ms,95%): 189.93 err/s 0.00 reconn/s: 0.00
[ 1300s ] thds: 4 tps: 38.70 qps: 1111.56 (r/w/o: 504.48/529.68/77.40) lat (ms,95%): 223.34 err/s 0.10 reconn/s: 0.00
[ 1310s ] thds: 4 tps: 36.60 qps: 1057.26 (r/w/o: 482.63/501.43/73.19) lat (ms,95%): 215.44 err/s 0.20 reconn/s: 0.00
[ 1320s ] thds: 4 tps: 36.01 qps: 1068.48 (r/w/o: 487.58/508.89/72.01) lat (ms,95%): 240.02 err/s 0.10 reconn/s: 0.00
[ 1330s ] thds: 4 tps: 34.20 qps: 962.52 (r/w/o: 441.11/453.01/68.40) lat (ms,95%): 257.95 err/s 0.30 reconn/s: 0.00
[ 1340s ] thds: 4 tps: 37.40 qps: 1138.08 (r/w/o: 516.59/546.69/74.80) lat (ms,95%): 223.34 err/s 0.20 reconn/s: 0.00
[ 1350s ] thds: 4 tps: 40.59 qps: 1214.25 (r/w/o: 554.93/578.13/81.19) lat (ms,95%): 207.82 err/s 0.10 reconn/s: 0.00
[ 1360s ] thds: 4 tps: 35.61 qps: 1049.75 (r/w/o: 480.57/497.97/71.21) lat (ms,95%): 219.36 err/s 0.00 reconn/s: 0.00
[ 1370s ] thds: 4 tps: 32.60 qps: 872.50 (r/w/o: 398.26/409.05/65.19) lat (ms,95%): 601.29 err/s 0.30 reconn/s: 0.00
[ 1380s ] thds: 4 tps: 34.40 qps: 953.92 (r/w/o: 434.35/450.76/68.81) lat (ms,95%): 282.25 err/s 0.10 reconn/s: 0.00
[ 1390s ] thds: 4 tps: 36.79 qps: 1150.92 (r/w/o: 524.22/553.12/73.59) lat (ms,95%): 200.47 err/s 0.00 reconn/s: 0.00
[ 1400s ] thds: 4 tps: 39.60 qps: 1112.25 (r/w/o: 504.82/528.22/79.20) lat (ms,95%): 193.38 err/s 0.50 reconn/s: 0.00
[ 1410s ] thds: 4 tps: 34.20 qps: 905.97 (r/w/o: 411.43/426.13/68.40) lat (ms,95%): 240.02 err/s 0.20 reconn/s: 0.00
[ 1420s ] thds: 4 tps: 37.50 qps: 1023.39 (r/w/o: 465.50/482.90/75.00) lat (ms,95%): 200.47 err/s 0.10 reconn/s: 0.00
[ 1430s ] thds: 4 tps: 42.20 qps: 1199.30 (r/w/o: 548.00/566.90/84.40) lat (ms,95%): 189.93 err/s 0.10 reconn/s: 0.00
[ 1440s ] thds: 4 tps: 41.50 qps: 1210.75 (r/w/o: 550.98/576.77/83.00) lat (ms,95%): 189.93 err/s 0.20 reconn/s: 0.00
[ 1450s ] thds: 4 tps: 39.60 qps: 1136.81 (r/w/o: 520.35/537.25/79.21) lat (ms,95%): 207.82 err/s 0.30 reconn/s: 0.00
[ 1460s ] thds: 4 tps: 42.20 qps: 1157.96 (r/w/o: 525.18/548.38/84.40) lat (ms,95%): 183.21 err/s 0.00 reconn/s: 0.00
[ 1470s ] thds: 4 tps: 38.40 qps: 1040.50 (r/w/o: 474.10/489.60/76.80) lat (ms,95%): 235.74 err/s 0.10 reconn/s: 0.00
[ 1480s ] thds: 4 tps: 35.00 qps: 1023.31 (r/w/o: 466.11/487.21/70.00) lat (ms,95%): 287.38 err/s 0.20 reconn/s: 0.00
[ 1490s ] thds: 4 tps: 31.90 qps: 905.88 (r/w/o: 409.05/433.04/63.79) lat (ms,95%): 253.35 err/s 0.00 reconn/s: 0.00
[ 1500s ] thds: 4 tps: 29.50 qps: 782.02 (r/w/o: 356.36/366.66/59.01) lat (ms,95%): 694.45 err/s 0.30 reconn/s: 0.00
[ 1510s ] thds: 4 tps: 32.00 qps: 957.86 (r/w/o: 437.98/455.88/64.00) lat (ms,95%): 580.02 err/s 0.00 reconn/s: 0.00
[ 1520s ] thds: 4 tps: 39.20 qps: 1159.30 (r/w/o: 530.50/550.40/78.40) lat (ms,95%): 196.89 err/s 0.00 reconn/s: 0.00
[ 1530s ] thds: 4 tps: 35.80 qps: 1014.86 (r/w/o: 461.78/481.48/71.60) lat (ms,95%): 215.44 err/s 0.30 reconn/s: 0.00
[ 1540s ] thds: 4 tps: 40.70 qps: 1148.99 (r/w/o: 525.05/542.55/81.39) lat (ms,95%): 200.47 err/s 0.30 reconn/s: 0.00
[ 1550s ] thds: 4 tps: 35.70 qps: 937.84 (r/w/o: 425.62/440.82/71.40) lat (ms,95%): 434.83 err/s 0.00 reconn/s: 0.00
[ 1560s ] thds: 4 tps: 36.80 qps: 1051.27 (r/w/o: 480.43/497.23/73.60) lat (ms,95%): 223.34 err/s 0.00 reconn/s: 0.00
[ 1570s ] thds: 4 tps: 30.10 qps: 883.53 (r/w/o: 403.81/419.51/60.20) lat (ms,95%): 707.07 err/s 0.10 reconn/s: 0.00
[ 1580s ] thds: 4 tps: 31.60 qps: 875.57 (r/w/o: 400.28/412.08/63.20) lat (ms,95%): 511.33 err/s 0.30 reconn/s: 0.00
[ 1590s ] thds: 4 tps: 43.50 qps: 1330.50 (r/w/o: 609.35/634.15/87.01) lat (ms,95%): 189.93 err/s 0.20 reconn/s: 0.00
[ 1600s ] thds: 4 tps: 35.80 qps: 1009.75 (r/w/o: 461.48/476.68/71.60) lat (ms,95%): 227.40 err/s 0.10 reconn/s: 0.00
[ 1610s ] thds: 4 tps: 37.50 qps: 1075.99 (r/w/o: 488.60/512.40/75.00) lat (ms,95%): 211.60 err/s 0.10 reconn/s: 0.00
[ 1620s ] thds: 4 tps: 40.90 qps: 1197.06 (r/w/o: 545.43/569.83/81.80) lat (ms,95%): 183.21 err/s 0.40 reconn/s: 0.00
[ 1630s ] thds: 4 tps: 39.40 qps: 1075.57 (r/w/o: 491.19/505.59/78.80) lat (ms,95%): 200.47 err/s 0.20 reconn/s: 0.00
[ 1640s ] thds: 4 tps: 37.00 qps: 1014.57 (r/w/o: 461.34/479.24/73.99) lat (ms,95%): 189.93 err/s 0.10 reconn/s: 0.00
[ 1650s ] thds: 4 tps: 37.30 qps: 1069.97 (r/w/o: 487.43/507.93/74.60) lat (ms,95%): 227.40 err/s 0.20 reconn/s: 0.00
[ 1660s ] thds: 4 tps: 37.30 qps: 1013.17 (r/w/o: 464.53/474.03/74.61) lat (ms,95%): 244.38 err/s 0.30 reconn/s: 0.00
[ 1670s ] thds: 4 tps: 36.60 qps: 1025.01 (r/w/o: 468.41/483.41/73.20) lat (ms,95%): 235.74 err/s 0.30 reconn/s: 0.00
[ 1680s ] thds: 4 tps: 41.20 qps: 1132.57 (r/w/o: 517.84/532.34/82.39) lat (ms,95%): 196.89 err/s 0.30 reconn/s: 0.00
[ 1690s ] thds: 4 tps: 36.70 qps: 1092.05 (r/w/o: 497.42/521.22/73.40) lat (ms,95%): 314.45 err/s 0.10 reconn/s: 0.00
[ 1700s ] thds: 4 tps: 40.30 qps: 1209.34 (r/w/o: 550.62/578.12/80.60) lat (ms,95%): 200.47 err/s 0.30 reconn/s: 0.00
[ 1710s ] thds: 4 tps: 42.00 qps: 1193.94 (r/w/o: 544.22/565.72/84.00) lat (ms,95%): 200.47 err/s 0.30 reconn/s: 0.00
[ 1720s ] thds: 4 tps: 34.60 qps: 1009.63 (r/w/o: 459.57/480.87/69.20) lat (ms,95%): 215.44 err/s 0.10 reconn/s: 0.00
[ 1730s ] thds: 4 tps: 38.90 qps: 1118.90 (r/w/o: 511.90/529.30/77.70) lat (ms,95%): 223.34 err/s 0.20 reconn/s: 0.00
[ 1740s ] thds: 4 tps: 40.60 qps: 1121.88 (r/w/o: 510.34/530.24/81.31) lat (ms,95%): 207.82 err/s 0.10 reconn/s: 0.00
[ 1750s ] thds: 4 tps: 35.60 qps: 1061.56 (r/w/o: 487.04/503.33/71.19) lat (ms,95%): 215.44 err/s 0.10 reconn/s: 0.00
[ 1760s ] thds: 4 tps: 37.20 qps: 1015.28 (r/w/o: 462.94/477.94/74.41) lat (ms,95%): 248.83 err/s 0.20 reconn/s: 0.00
[ 1770s ] thds: 4 tps: 32.70 qps: 978.95 (r/w/o: 445.52/468.02/65.40) lat (ms,95%): 267.41 err/s 0.00 reconn/s: 0.00
[ 1780s ] thds: 4 tps: 35.30 qps: 920.63 (r/w/o: 420.97/429.07/70.59) lat (ms,95%): 411.96 err/s 0.30 reconn/s: 0.00
[ 1790s ] thds: 4 tps: 38.60 qps: 1099.22 (r/w/o: 498.71/523.31/77.20) lat (ms,95%): 211.60 err/s 0.10 reconn/s: 0.00
[ 1800s ] thds: 4 tps: 36.20 qps: 1007.52 (r/w/o: 457.41/477.71/72.40) lat (ms,95%): 303.33 err/s 0.40 reconn/s: 0.00
[ 1810s ] thds: 4 tps: 42.10 qps: 1189.60 (r/w/o: 541.80/563.60/84.20) lat (ms,95%): 204.11 err/s 0.40 reconn/s: 0.00
[ 1820s ] thds: 4 tps: 35.50 qps: 996.15 (r/w/o: 454.92/470.22/71.00) lat (ms,95%): 244.38 err/s 0.10 reconn/s: 0.00
[ 1830s ] thds: 4 tps: 38.00 qps: 1000.47 (r/w/o: 459.19/465.29/76.00) lat (ms,95%): 227.40 err/s 0.30 reconn/s: 0.00
[ 1840s ] thds: 4 tps: 36.10 qps: 983.23 (r/w/o: 450.61/460.41/72.20) lat (ms,95%): 253.35 err/s 0.20 reconn/s: 0.00
[ 1850s ] thds: 4 tps: 40.10 qps: 1204.75 (r/w/o: 548.88/575.67/80.20) lat (ms,95%): 200.47 err/s 0.10 reconn/s: 0.00
[ 1860s ] thds: 4 tps: 37.70 qps: 1048.68 (r/w/o: 481.19/492.09/75.40) lat (ms,95%): 231.53 err/s 0.10 reconn/s: 0.00
[ 1870s ] thds: 4 tps: 33.40 qps: 987.74 (r/w/o: 453.02/467.92/66.80) lat (ms,95%): 267.41 err/s 0.00 reconn/s: 0.00
[ 1880s ] thds: 4 tps: 34.80 qps: 1028.26 (r/w/o: 471.68/486.98/69.60) lat (ms,95%): 219.36 err/s 0.00 reconn/s: 0.00
[ 1890s ] thds: 4 tps: 41.00 qps: 1109.81 (r/w/o: 501.36/526.46/81.99) lat (ms,95%): 227.40 err/s 0.10 reconn/s: 0.00
[ 1900s ] thds: 4 tps: 30.10 qps: 930.84 (r/w/o: 423.42/447.22/60.20) lat (ms,95%): 719.92 err/s 0.10 reconn/s: 0.00
[ 1910s ] thds: 4 tps: 34.20 qps: 980.25 (r/w/o: 449.22/462.62/68.40) lat (ms,95%): 244.38 err/s 0.30 reconn/s: 0.00
[ 1920s ] thds: 4 tps: 42.10 qps: 1215.51 (r/w/o: 549.96/581.36/84.19) lat (ms,95%): 200.47 err/s 0.20 reconn/s: 0.00
[ 1930s ] thds: 4 tps: 37.60 qps: 1119.85 (r/w/o: 512.02/532.62/75.20) lat (ms,95%): 211.60 err/s 0.20 reconn/s: 0.00
[ 1940s ] thds: 4 tps: 38.50 qps: 1083.05 (r/w/o: 495.32/510.72/77.00) lat (ms,95%): 244.38 err/s 0.00 reconn/s: 0.00
[ 1950s ] thds: 4 tps: 33.70 qps: 945.25 (r/w/o: 433.38/444.47/67.40) lat (ms,95%): 287.38 err/s 0.10 reconn/s: 0.00
[ 1960s ] thds: 4 tps: 38.10 qps: 1055.04 (r/w/o: 482.82/496.02/76.20) lat (ms,95%): 183.21 err/s 0.20 reconn/s: 0.00
[ 1970s ] thds: 4 tps: 37.69 qps: 1034.33 (r/w/o: 473.12/485.82/75.39) lat (ms,95%): 219.36 err/s 0.30 reconn/s: 0.00
[ 1980s ] thds: 4 tps: 35.20 qps: 972.87 (r/w/o: 439.93/462.53/70.41) lat (ms,95%): 267.41 err/s 0.00 reconn/s: 0.00
[ 1990s ] thds: 4 tps: 36.20 qps: 1074.91 (r/w/o: 492.55/509.95/72.41) lat (ms,95%): 320.17 err/s 0.00 reconn/s: 0.00
[ 2000s ] thds: 4 tps: 38.00 qps: 1138.18 (r/w/o: 518.39/543.79/76.00) lat (ms,95%): 235.74 err/s 0.20 reconn/s: 0.00
[ 2010s ] thds: 4 tps: 42.60 qps: 1140.85 (r/w/o: 520.42/535.22/85.20) lat (ms,95%): 183.21 err/s 0.00 reconn/s: 0.00
[ 2020s ] thds: 4 tps: 34.20 qps: 1022.65 (r/w/o: 467.18/487.08/68.40) lat (ms,95%): 257.95 err/s 0.20 reconn/s: 0.00
[ 2030s ] thds: 4 tps: 36.30 qps: 1061.86 (r/w/o: 484.38/504.88/72.60) lat (ms,95%): 204.11 err/s 0.30 reconn/s: 0.00
[ 2040s ] thds: 4 tps: 32.20 qps: 888.25 (r/w/o: 406.28/417.58/64.40) lat (ms,95%): 682.06 err/s 0.30 reconn/s: 0.00
[ 2050s ] thds: 4 tps: 34.10 qps: 951.11 (r/w/o: 432.05/450.85/68.21) lat (ms,95%): 282.25 err/s 0.00 reconn/s: 0.00
[ 2060s ] thds: 4 tps: 36.70 qps: 1046.78 (r/w/o: 477.09/496.29/73.40) lat (ms,95%): 244.38 err/s 0.10 reconn/s: 0.00
[ 2070s ] thds: 4 tps: 42.10 qps: 1204.33 (r/w/o: 549.37/570.77/84.20) lat (ms,95%): 193.38 err/s 0.30 reconn/s: 0.00
[ 2080s ] thds: 4 tps: 34.80 qps: 1014.26 (r/w/o: 463.43/481.23/69.60) lat (ms,95%): 253.35 err/s 0.30 reconn/s: 0.00
[ 2090s ] thds: 4 tps: 39.20 qps: 1093.16 (r/w/o: 495.43/519.33/78.40) lat (ms,95%): 219.36 err/s 0.20 reconn/s: 0.00
[ 2100s ] thds: 4 tps: 32.40 qps: 916.06 (r/w/o: 417.98/433.28/64.80) lat (ms,95%): 530.08 err/s 0.50 reconn/s: 0.00
[ 2110s ] thds: 4 tps: 41.50 qps: 1199.64 (r/w/o: 547.92/568.72/83.00) lat (ms,95%): 231.53 err/s 0.20 reconn/s: 0.00
[ 2120s ] thds: 4 tps: 35.20 qps: 946.31 (r/w/o: 431.66/444.26/70.39) lat (ms,95%): 231.53 err/s 0.10 reconn/s: 0.00
[ 2130s ] thds: 4 tps: 37.69 qps: 1033.56 (r/w/o: 472.04/486.13/75.39) lat (ms,95%): 248.83 err/s 0.10 reconn/s: 0.00
[ 2140s ] thds: 4 tps: 37.71 qps: 1027.74 (r/w/o: 469.41/482.91/75.42) lat (ms,95%): 248.83 err/s 0.10 reconn/s: 0.00
[ 2150s ] thds: 4 tps: 34.30 qps: 982.04 (r/w/o: 449.17/464.27/68.60) lat (ms,95%): 282.25 err/s 0.70 reconn/s: 0.00
[ 2160s ] thds: 4 tps: 35.40 qps: 1043.67 (r/w/o: 479.33/493.53/70.80) lat (ms,95%): 248.83 err/s 0.00 reconn/s: 0.00
[ 2170s ] thds: 4 tps: 32.20 qps: 895.65 (r/w/o: 409.98/421.27/64.40) lat (ms,95%): 733.00 err/s 0.30 reconn/s: 0.00
[ 2180s ] thds: 4 tps: 37.80 qps: 1063.96 (r/w/o: 482.88/505.48/75.60) lat (ms,95%): 207.82 err/s 0.20 reconn/s: 0.00
[ 2190s ] thds: 4 tps: 34.20 qps: 940.68 (r/w/o: 428.74/443.54/68.41) lat (ms,95%): 248.83 err/s 0.10 reconn/s: 0.00
[ 2200s ] thds: 4 tps: 29.40 qps: 900.69 (r/w/o: 410.75/431.15/58.79) lat (ms,95%): 549.52 err/s 0.00 reconn/s: 0.00
[ 2210s ] thds: 4 tps: 36.00 qps: 1026.43 (r/w/o: 470.06/484.36/72.01) lat (ms,95%): 248.83 err/s 0.00 reconn/s: 0.00
[ 2220s ] thds: 4 tps: 38.60 qps: 1107.20 (r/w/o: 504.00/526.00/77.20) lat (ms,95%): 204.11 err/s 0.10 reconn/s: 0.00
[ 2230s ] thds: 4 tps: 29.50 qps: 774.04 (r/w/o: 353.47/361.57/59.00) lat (ms,95%): 733.00 err/s 0.20 reconn/s: 0.00
[ 2240s ] thds: 4 tps: 30.40 qps: 857.03 (r/w/o: 391.01/405.21/60.80) lat (ms,95%): 580.02 err/s 0.10 reconn/s: 0.00
[ 2250s ] thds: 4 tps: 32.80 qps: 911.33 (r/w/o: 417.41/428.31/65.60) lat (ms,95%): 502.20 err/s 0.20 reconn/s: 0.00
[ 2260s ] thds: 4 tps: 35.60 qps: 978.61 (r/w/o: 449.31/458.11/71.20) lat (ms,95%): 240.02 err/s 0.10 reconn/s: 0.00
[ 2270s ] thds: 4 tps: 39.00 qps: 1169.38 (r/w/o: 533.04/558.34/77.99) lat (ms,95%): 204.11 err/s 0.00 reconn/s: 0.00
[ 2280s ] thds: 4 tps: 35.80 qps: 1008.80 (r/w/o: 462.20/475.00/71.60) lat (ms,95%): 257.95 err/s 0.10 reconn/s: 0.00
[ 2290s ] thds: 4 tps: 38.60 qps: 995.24 (r/w/o: 454.17/463.87/77.20) lat (ms,95%): 227.40 err/s 0.40 reconn/s: 0.00
[ 2300s ] thds: 4 tps: 30.71 qps: 846.15 (r/w/o: 386.47/398.27/61.41) lat (ms,95%): 759.88 err/s 0.00 reconn/s: 0.00
[ 2310s ] thds: 4 tps: 38.10 qps: 1087.76 (r/w/o: 497.68/513.88/76.20) lat (ms,95%): 207.82 err/s 0.20 reconn/s: 0.00
[ 2320s ] thds: 4 tps: 34.50 qps: 978.43 (r/w/o: 443.67/465.77/69.00) lat (ms,95%): 282.25 err/s 0.00 reconn/s: 0.00
[ 2330s ] thds: 4 tps: 34.59 qps: 924.64 (r/w/o: 422.93/432.52/69.19) lat (ms,95%): 235.74 err/s 0.00 reconn/s: 0.00
[ 2340s ] thds: 4 tps: 40.41 qps: 1162.76 (r/w/o: 528.77/553.18/80.81) lat (ms,95%): 223.34 err/s 0.00 reconn/s: 0.00
[ 2350s ] thds: 4 tps: 38.90 qps: 1117.59 (r/w/o: 509.29/530.49/77.80) lat (ms,95%): 207.82 err/s 0.20 reconn/s: 0.00
[ 2360s ] thds: 4 tps: 34.50 qps: 1033.31 (r/w/o: 474.75/489.55/69.01) lat (ms,95%): 227.40 err/s 0.00 reconn/s: 0.00
[ 2370s ] thds: 4 tps: 37.40 qps: 1033.93 (r/w/o: 471.21/487.91/74.80) lat (ms,95%): 211.60 err/s 0.00 reconn/s: 0.00
[ 2380s ] thds: 4 tps: 35.10 qps: 950.38 (r/w/o: 435.49/444.69/70.20) lat (ms,95%): 314.45 err/s 0.20 reconn/s: 0.00
[ 2390s ] thds: 4 tps: 40.20 qps: 1168.57 (r/w/o: 532.04/556.14/80.39) lat (ms,95%): 196.89 err/s 0.30 reconn/s: 0.00
[ 2400s ] thds: 4 tps: 34.21 qps: 1001.15 (r/w/o: 456.37/476.37/68.41) lat (ms,95%): 248.83 err/s 0.10 reconn/s: 0.00
[ 2410s ] thds: 4 tps: 36.90 qps: 1075.51 (r/w/o: 488.46/513.25/73.79) lat (ms,95%): 248.83 err/s 0.50 reconn/s: 0.00
[ 2420s ] thds: 4 tps: 36.50 qps: 1060.60 (r/w/o: 485.50/502.20/72.90) lat (ms,95%): 219.36 err/s 0.00 reconn/s: 0.00
[ 2430s ] thds: 4 tps: 37.80 qps: 1082.60 (r/w/o: 493.25/513.65/75.71) lat (ms,95%): 223.34 err/s 0.30 reconn/s: 0.00
[ 2440s ] thds: 4 tps: 40.40 qps: 1142.66 (r/w/o: 519.88/541.98/80.80) lat (ms,95%): 200.47 err/s 0.00 reconn/s: 0.00
[ 2450s ] thds: 4 tps: 37.50 qps: 1029.15 (r/w/o: 468.08/486.08/75.00) lat (ms,95%): 235.74 err/s 0.00 reconn/s: 0.00
[ 2460s ] thds: 4 tps: 35.90 qps: 1051.05 (r/w/o: 476.62/502.63/71.80) lat (ms,95%): 244.38 err/s 0.00 reconn/s: 0.00
[ 2470s ] thds: 4 tps: 39.20 qps: 1037.40 (r/w/o: 473.50/485.50/78.40) lat (ms,95%): 211.60 err/s 0.20 reconn/s: 0.00
[ 2480s ] thds: 4 tps: 33.20 qps: 908.21 (r/w/o: 414.76/427.06/66.39) lat (ms,95%): 297.92 err/s 0.00 reconn/s: 0.00
[ 2490s ] thds: 4 tps: 41.21 qps: 1058.73 (r/w/o: 480.26/496.06/82.41) lat (ms,95%): 227.40 err/s 0.20 reconn/s: 0.00
[ 2500s ] thds: 4 tps: 40.20 qps: 1058.70 (r/w/o: 481.76/496.55/80.39) lat (ms,95%): 204.11 err/s 0.30 reconn/s: 0.00
[ 2510s ] thds: 4 tps: 36.20 qps: 998.88 (r/w/o: 455.64/470.84/72.39) lat (ms,95%): 314.45 err/s 0.20 reconn/s: 0.00
[ 2520s ] thds: 4 tps: 40.71 qps: 1179.86 (r/w/o: 538.27/560.18/81.41) lat (ms,95%): 189.93 err/s 0.10 reconn/s: 0.00
[ 2530s ] thds: 4 tps: 36.10 qps: 1046.67 (r/w/o: 477.69/496.79/72.20) lat (ms,95%): 363.18 err/s 0.10 reconn/s: 0.00
[ 2540s ] thds: 4 tps: 34.40 qps: 900.57 (r/w/o: 411.29/420.49/68.80) lat (ms,95%): 267.41 err/s 0.10 reconn/s: 0.00
[ 2550s ] thds: 4 tps: 39.70 qps: 1066.80 (r/w/o: 482.64/504.75/79.41) lat (ms,95%): 204.11 err/s 0.00 reconn/s: 0.00
[ 2560s ] thds: 4 tps: 38.29 qps: 1128.63 (r/w/o: 513.12/538.92/76.59) lat (ms,95%): 227.40 err/s 0.00 reconn/s: 0.00
[ 2570s ] thds: 4 tps: 34.11 qps: 934.28 (r/w/o: 425.98/440.08/68.21) lat (ms,95%): 634.66 err/s 0.10 reconn/s: 0.00
[ 2580s ] thds: 4 tps: 35.00 qps: 1040.47 (r/w/o: 473.58/496.88/70.00) lat (ms,95%): 227.40 err/s 0.10 reconn/s: 0.00
[ 2590s ] thds: 4 tps: 43.10 qps: 1187.97 (r/w/o: 538.84/562.94/86.19) lat (ms,95%): 186.54 err/s 0.00 reconn/s: 0.00
[ 2600s ] thds: 4 tps: 41.11 qps: 1197.77 (r/w/o: 545.58/569.98/82.21) lat (ms,95%): 215.44 err/s 0.00 reconn/s: 0.00
[ 2610s ] thds: 4 tps: 38.70 qps: 1210.45 (r/w/o: 550.43/582.63/77.39) lat (ms,95%): 211.60 err/s 0.00 reconn/s: 0.00
[ 2620s ] thds: 4 tps: 39.50 qps: 1102.35 (r/w/o: 503.42/519.92/79.00) lat (ms,95%): 189.93 err/s 0.20 reconn/s: 0.00
[ 2630s ] thds: 4 tps: 30.79 qps: 850.16 (r/w/o: 385.14/403.43/61.59) lat (ms,95%): 719.92 err/s 0.10 reconn/s: 0.00
[ 2640s ] thds: 4 tps: 35.81 qps: 939.11 (r/w/o: 428.40/439.10/71.62) lat (ms,95%): 308.84 err/s 0.20 reconn/s: 0.00
[ 2650s ] thds: 4 tps: 36.70 qps: 1003.27 (r/w/o: 456.09/473.79/73.40) lat (ms,95%): 223.34 err/s 0.00 reconn/s: 0.00
[ 2660s ] thds: 4 tps: 36.30 qps: 1072.54 (r/w/o: 490.37/509.57/72.60) lat (ms,95%): 223.34 err/s 0.00 reconn/s: 0.00
[ 2670s ] thds: 4 tps: 38.00 qps: 1118.30 (r/w/o: 508.60/533.70/76.00) lat (ms,95%): 207.82 err/s 0.10 reconn/s: 0.00
[ 2680s ] thds: 4 tps: 35.40 qps: 1017.01 (r/w/o: 465.75/480.45/70.81) lat (ms,95%): 267.41 err/s 0.20 reconn/s: 0.00
[ 2690s ] thds: 4 tps: 32.59 qps: 945.02 (r/w/o: 429.92/449.92/65.19) lat (ms,95%): 272.27 err/s 0.20 reconn/s: 0.00
[ 2700s ] thds: 4 tps: 40.81 qps: 1189.31 (r/w/o: 542.59/565.10/81.61) lat (ms,95%): 277.21 err/s 0.00 reconn/s: 0.00
[ 2710s ] thds: 4 tps: 33.00 qps: 1034.02 (r/w/o: 469.61/498.41/66.00) lat (ms,95%): 331.91 err/s 0.30 reconn/s: 0.00
[ 2720s ] thds: 4 tps: 32.80 qps: 986.17 (r/w/o: 452.69/467.89/65.60) lat (ms,95%): 287.38 err/s 0.30 reconn/s: 0.00
[ 2730s ] thds: 4 tps: 41.70 qps: 1311.74 (r/w/o: 597.42/630.92/83.40) lat (ms,95%): 215.44 err/s 0.10 reconn/s: 0.00
[ 2740s ] thds: 4 tps: 37.80 qps: 1092.80 (r/w/o: 498.80/518.40/75.60) lat (ms,95%): 248.83 err/s 0.20 reconn/s: 0.00
[ 2750s ] thds: 4 tps: 45.50 qps: 1212.09 (r/w/o: 552.10/569.00/91.00) lat (ms,95%): 186.54 err/s 0.00 reconn/s: 0.00
[ 2760s ] thds: 4 tps: 42.00 qps: 1102.66 (r/w/o: 502.98/515.68/84.00) lat (ms,95%): 196.89 err/s 0.10 reconn/s: 0.00
[ 2770s ] thds: 4 tps: 41.90 qps: 1213.36 (r/w/o: 554.53/575.03/83.80) lat (ms,95%): 186.54 err/s 0.10 reconn/s: 0.00
[ 2780s ] thds: 4 tps: 31.90 qps: 851.66 (r/w/o: 390.38/397.48/63.80) lat (ms,95%): 539.71 err/s 0.00 reconn/s: 0.00
[ 2790s ] thds: 4 tps: 35.50 qps: 1015.99 (r/w/o: 466.85/478.15/70.99) lat (ms,95%): 211.60 err/s 0.00 reconn/s: 0.00
[ 2800s ] thds: 4 tps: 44.21 qps: 1203.37 (r/w/o: 545.68/569.28/88.41) lat (ms,95%): 204.11 err/s 0.20 reconn/s: 0.00
[ 2810s ] thds: 4 tps: 32.79 qps: 915.15 (r/w/o: 417.33/432.23/65.59) lat (ms,95%): 569.67 err/s 0.00 reconn/s: 0.00
[ 2820s ] thds: 4 tps: 43.61 qps: 1205.60 (r/w/o: 550.69/567.69/87.21) lat (ms,95%): 179.94 err/s 0.10 reconn/s: 0.00
[ 2830s ] thds: 4 tps: 37.30 qps: 1131.06 (r/w/o: 518.48/537.98/74.60) lat (ms,95%): 240.02 err/s 0.20 reconn/s: 0.00
[ 2840s ] thds: 4 tps: 37.40 qps: 1075.90 (r/w/o: 489.30/511.80/74.80) lat (ms,95%): 231.53 err/s 0.00 reconn/s: 0.00
[ 2850s ] thds: 4 tps: 34.10 qps: 924.74 (r/w/o: 422.42/434.12/68.20) lat (ms,95%): 267.41 err/s 0.30 reconn/s: 0.00
[ 2860s ] thds: 4 tps: 32.50 qps: 908.93 (r/w/o: 416.47/427.47/65.00) lat (ms,95%): 272.27 err/s 0.10 reconn/s: 0.00
[ 2870s ] thds: 4 tps: 33.10 qps: 1004.28 (r/w/o: 456.29/481.79/66.20) lat (ms,95%): 369.77 err/s 0.10 reconn/s: 0.00
[ 2880s ] thds: 4 tps: 36.10 qps: 1016.95 (r/w/o: 467.18/477.57/72.20) lat (ms,95%): 235.74 err/s 0.30 reconn/s: 0.00
[ 2890s ] thds: 4 tps: 43.10 qps: 1125.53 (r/w/o: 515.51/523.81/86.20) lat (ms,95%): 207.82 err/s 0.00 reconn/s: 0.00
[ 2900s ] thds: 4 tps: 33.20 qps: 965.88 (r/w/o: 442.34/457.14/66.41) lat (ms,95%): 297.92 err/s 0.20 reconn/s: 0.00
[ 2910s ] thds: 4 tps: 37.00 qps: 1001.21 (r/w/o: 459.46/467.76/73.99) lat (ms,95%): 223.34 err/s 0.00 reconn/s: 0.00
[ 2920s ] thds: 4 tps: 35.40 qps: 979.50 (r/w/o: 448.04/460.65/70.81) lat (ms,95%): 235.74 err/s 0.10 reconn/s: 0.00
[ 2930s ] thds: 4 tps: 30.39 qps: 879.16 (r/w/o: 403.79/414.59/60.78) lat (ms,95%): 376.49 err/s 0.10 reconn/s: 0.00
[ 2940s ] thds: 4 tps: 29.61 qps: 835.40 (r/w/o: 380.49/395.69/59.21) lat (ms,95%): 623.33 err/s 0.10 reconn/s: 0.00
[ 2950s ] thds: 4 tps: 37.10 qps: 1079.97 (r/w/o: 495.94/509.84/74.19) lat (ms,95%): 244.38 err/s 0.00 reconn/s: 0.00
[ 2960s ] thds: 4 tps: 32.20 qps: 901.06 (r/w/o: 409.48/427.18/64.40) lat (ms,95%): 376.49 err/s 0.00 reconn/s: 0.00
[ 2970s ] thds: 4 tps: 28.00 qps: 825.54 (r/w/o: 378.26/391.26/56.01) lat (ms,95%): 846.57 err/s 0.30 reconn/s: 0.00
[ 2980s ] thds: 4 tps: 44.00 qps: 1237.06 (r/w/o: 564.08/584.98/88.00) lat (ms,95%): 193.38 err/s 0.10 reconn/s: 0.00
[ 2990s ] thds: 4 tps: 43.20 qps: 1200.78 (r/w/o: 548.69/565.69/86.40) lat (ms,95%): 183.21 err/s 0.10 reconn/s: 0.00
[ 3000s ] thds: 4 tps: 36.10 qps: 1011.44 (r/w/o: 461.07/478.17/72.20) lat (ms,95%): 219.36 err/s 0.10 reconn/s: 0.00
[ 3010s ] thds: 4 tps: 39.91 qps: 1134.65 (r/w/o: 515.57/539.27/79.81) lat (ms,95%): 215.44 err/s 0.10 reconn/s: 0.00
[ 3020s ] thds: 4 tps: 35.50 qps: 1000.51 (r/w/o: 456.96/472.56/70.99) lat (ms,95%): 231.53 err/s 0.00 reconn/s: 0.00
[ 3030s ] thds: 4 tps: 33.20 qps: 891.04 (r/w/o: 406.52/418.12/66.40) lat (ms,95%): 549.52 err/s 0.10 reconn/s: 0.00
[ 3040s ] thds: 4 tps: 32.90 qps: 868.37 (r/w/o: 395.83/406.73/65.81) lat (ms,95%): 539.71 err/s 0.10 reconn/s: 0.00
[ 3050s ] thds: 4 tps: 39.20 qps: 1078.31 (r/w/o: 488.36/511.56/78.39) lat (ms,95%): 248.83 err/s 0.10 reconn/s: 0.00
[ 3060s ] thds: 4 tps: 40.30 qps: 1142.78 (r/w/o: 519.89/542.29/80.60) lat (ms,95%): 215.44 err/s 0.10 reconn/s: 0.00
[ 3070s ] thds: 4 tps: 40.50 qps: 1116.67 (r/w/o: 506.23/529.43/81.01) lat (ms,95%): 207.82 err/s 0.30 reconn/s: 0.00
[ 3080s ] thds: 4 tps: 34.69 qps: 983.14 (r/w/o: 450.93/462.83/69.39) lat (ms,95%): 272.27 err/s 0.30 reconn/s: 0.00
[ 3090s ] thds: 4 tps: 40.31 qps: 1111.72 (r/w/o: 508.10/523.00/80.62) lat (ms,95%): 193.38 err/s 0.00 reconn/s: 0.00
[ 3100s ] thds: 4 tps: 32.89 qps: 921.40 (r/w/o: 422.91/432.70/65.79) lat (ms,95%): 682.06 err/s 0.30 reconn/s: 0.00
[ 3110s ] thds: 4 tps: 29.81 qps: 852.36 (r/w/o: 388.67/404.07/59.61) lat (ms,95%): 682.06 err/s 0.20 reconn/s: 0.00
[ 3120s ] thds: 4 tps: 37.00 qps: 1090.82 (r/w/o: 498.01/518.81/74.00) lat (ms,95%): 253.35 err/s 0.30 reconn/s: 0.00
[ 3130s ] thds: 4 tps: 41.10 qps: 1143.18 (r/w/o: 522.09/538.89/82.20) lat (ms,95%): 200.47 err/s 0.20 reconn/s: 0.00
[ 3140s ] thds: 4 tps: 36.10 qps: 986.50 (r/w/o: 450.50/463.80/72.20) lat (ms,95%): 240.02 err/s 0.30 reconn/s: 0.00
[ 3150s ] thds: 4 tps: 42.10 qps: 1226.14 (r/w/o: 557.32/584.62/84.20) lat (ms,95%): 193.38 err/s 0.20 reconn/s: 0.00
[ 3160s ] thds: 4 tps: 39.10 qps: 1103.36 (r/w/o: 504.28/520.88/78.20) lat (ms,95%): 223.34 err/s 0.00 reconn/s: 0.00
[ 3170s ] thds: 4 tps: 36.90 qps: 1044.48 (r/w/o: 476.39/494.29/73.80) lat (ms,95%): 227.40 err/s 0.10 reconn/s: 0.00
[ 3180s ] thds: 4 tps: 35.20 qps: 1000.37 (r/w/o: 454.19/475.79/70.40) lat (ms,95%): 240.02 err/s 0.20 reconn/s: 0.00
[ 3190s ] thds: 4 tps: 35.60 qps: 939.99 (r/w/o: 427.60/441.20/71.20) lat (ms,95%): 287.38 err/s 0.30 reconn/s: 0.00
[ 3200s ] thds: 4 tps: 33.50 qps: 933.83 (r/w/o: 426.07/440.77/66.99) lat (ms,95%): 267.41 err/s 0.10 reconn/s: 0.00
[ 3210s ] thds: 4 tps: 40.90 qps: 1062.09 (r/w/o: 480.54/499.74/81.81) lat (ms,95%): 235.74 err/s 0.20 reconn/s: 0.00
[ 3220s ] thds: 4 tps: 43.10 qps: 1169.01 (r/w/o: 532.96/549.86/86.19) lat (ms,95%): 204.11 err/s 0.20 reconn/s: 0.00
[ 3230s ] thds: 4 tps: 29.80 qps: 874.30 (r/w/o: 398.95/415.75/59.61) lat (ms,95%): 559.50 err/s 0.00 reconn/s: 0.00
[ 3240s ] thds: 4 tps: 47.20 qps: 1358.06 (r/w/o: 622.63/641.03/94.40) lat (ms,95%): 176.73 err/s 0.30 reconn/s: 0.00
[ 3250s ] thds: 4 tps: 35.20 qps: 951.90 (r/w/o: 433.50/448.00/70.40) lat (ms,95%): 253.35 err/s 0.10 reconn/s: 0.00
[ 3260s ] thds: 4 tps: 43.60 qps: 1180.77 (r/w/o: 536.54/557.04/87.19) lat (ms,95%): 196.89 err/s 0.00 reconn/s: 0.00
[ 3270s ] thds: 4 tps: 43.00 qps: 1185.81 (r/w/o: 543.25/556.55/86.01) lat (ms,95%): 204.11 err/s 0.10 reconn/s: 0.00
[ 3280s ] thds: 4 tps: 33.39 qps: 954.04 (r/w/o: 435.13/452.12/66.79) lat (ms,95%): 277.21 err/s 0.00 reconn/s: 0.00
[ 3290s ] thds: 4 tps: 31.60 qps: 871.10 (r/w/o: 398.50/409.40/63.20) lat (ms,95%): 580.02 err/s 0.10 reconn/s: 0.00
[ 3300s ] thds: 4 tps: 34.10 qps: 962.43 (r/w/o: 438.36/455.86/68.21) lat (ms,95%): 493.24 err/s 0.20 reconn/s: 0.00
[ 3310s ] thds: 4 tps: 40.10 qps: 1146.26 (r/w/o: 522.48/543.58/80.20) lat (ms,95%): 223.34 err/s 0.20 reconn/s: 0.00
[ 3320s ] thds: 4 tps: 36.00 qps: 1008.25 (r/w/o: 462.18/474.08/72.00) lat (ms,95%): 257.95 err/s 0.20 reconn/s: 0.00
[ 3330s ] thds: 4 tps: 32.90 qps: 975.83 (r/w/o: 446.26/463.76/65.81) lat (ms,95%): 694.45 err/s 0.30 reconn/s: 0.00
[ 3340s ] thds: 4 tps: 38.30 qps: 1104.20 (r/w/o: 504.00/523.60/76.60) lat (ms,95%): 207.82 err/s 0.10 reconn/s: 0.00
[ 3350s ] thds: 4 tps: 34.30 qps: 998.70 (r/w/o: 460.75/469.35/68.59) lat (ms,95%): 240.02 err/s 0.10 reconn/s: 0.00
[ 3360s ] thds: 4 tps: 38.20 qps: 1066.58 (r/w/o: 491.44/498.74/76.41) lat (ms,95%): 200.47 err/s 0.10 reconn/s: 0.00
[ 3370s ] thds: 4 tps: 38.80 qps: 1109.27 (r/w/o: 506.59/525.09/77.60) lat (ms,95%): 219.36 err/s 0.00 reconn/s: 0.00
[ 3380s ] thds: 4 tps: 30.70 qps: 861.20 (r/w/o: 391.10/408.80/61.30) lat (ms,95%): 831.46 err/s 0.10 reconn/s: 0.00
[ 3390s ] thds: 4 tps: 33.60 qps: 981.73 (r/w/o: 448.92/465.52/67.30) lat (ms,95%): 272.27 err/s 0.30 reconn/s: 0.00
[ 3400s ] thds: 4 tps: 35.90 qps: 1073.08 (r/w/o: 489.19/512.09/71.80) lat (ms,95%): 287.38 err/s 0.00 reconn/s: 0.00
[ 3410s ] thds: 4 tps: 38.80 qps: 1124.84 (r/w/o: 509.42/537.82/77.60) lat (ms,95%): 223.34 err/s 0.20 reconn/s: 0.00
[ 3420s ] thds: 4 tps: 51.60 qps: 1419.78 (r/w/o: 643.84/672.74/103.19) lat (ms,95%): 161.51 err/s 0.10 reconn/s: 0.00
[ 3430s ] thds: 4 tps: 45.10 qps: 1352.04 (r/w/o: 618.72/643.12/90.20) lat (ms,95%): 176.73 err/s 0.10 reconn/s: 0.00
[ 3440s ] thds: 4 tps: 43.10 qps: 1300.67 (r/w/o: 594.19/620.29/86.20) lat (ms,95%): 186.54 err/s 0.10 reconn/s: 0.00
[ 3450s ] thds: 4 tps: 43.40 qps: 1233.14 (r/w/o: 563.92/582.42/86.80) lat (ms,95%): 193.38 err/s 0.40 reconn/s: 0.00
[ 3460s ] thds: 4 tps: 35.40 qps: 912.34 (r/w/o: 414.92/426.62/70.80) lat (ms,95%): 257.95 err/s 0.00 reconn/s: 0.00
[ 3470s ] thds: 4 tps: 37.10 qps: 1103.00 (r/w/o: 501.10/527.70/74.20) lat (ms,95%): 215.44 err/s 0.10 reconn/s: 0.00
[ 3480s ] thds: 4 tps: 38.90 qps: 1131.49 (r/w/o: 514.55/539.15/77.79) lat (ms,95%): 223.34 err/s 0.20 reconn/s: 0.00
[ 3490s ] thds: 4 tps: 32.20 qps: 972.68 (r/w/o: 443.69/464.59/64.40) lat (ms,95%): 272.27 err/s 0.10 reconn/s: 0.00
[ 3500s ] thds: 4 tps: 34.40 qps: 1003.32 (r/w/o: 455.05/479.46/68.81) lat (ms,95%): 287.38 err/s 0.10 reconn/s: 0.00
[ 3510s ] thds: 4 tps: 39.60 qps: 1107.60 (r/w/o: 503.70/524.70/79.20) lat (ms,95%): 223.34 err/s 0.10 reconn/s: 0.00
[ 3520s ] thds: 4 tps: 37.00 qps: 1001.49 (r/w/o: 457.45/470.05/73.99) lat (ms,95%): 262.64 err/s 0.10 reconn/s: 0.00
[ 3530s ] thds: 4 tps: 44.70 qps: 1233.83 (r/w/o: 563.76/580.66/89.41) lat (ms,95%): 200.47 err/s 0.40 reconn/s: 0.00
[ 3540s ] thds: 4 tps: 43.10 qps: 1177.59 (r/w/o: 536.95/554.45/86.19) lat (ms,95%): 204.11 err/s 0.30 reconn/s: 0.00
[ 3550s ] thds: 4 tps: 34.20 qps: 1000.85 (r/w/o: 454.78/477.68/68.40) lat (ms,95%): 257.95 err/s 0.10 reconn/s: 0.00
[ 3560s ] thds: 4 tps: 32.10 qps: 911.45 (r/w/o: 412.08/435.17/64.20) lat (ms,95%): 292.60 err/s 0.10 reconn/s: 0.00
[ 3570s ] thds: 4 tps: 34.51 qps: 990.00 (r/w/o: 452.09/468.89/69.01) lat (ms,95%): 277.21 err/s 0.10 reconn/s: 0.00
[ 3580s ] thds: 4 tps: 33.50 qps: 993.09 (r/w/o: 452.20/473.90/67.00) lat (ms,95%): 314.45 err/s 0.50 reconn/s: 0.00
[ 3590s ] thds: 4 tps: 31.40 qps: 878.68 (r/w/o: 404.39/411.49/62.80) lat (ms,95%): 344.08 err/s 0.00 reconn/s: 0.00
[ 3600s ] thds: 4 tps: 37.40 qps: 969.23 (r/w/o: 443.71/450.71/74.80) lat (ms,95%): 350.33 err/s 0.10 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1616005
        write:                           1675692
        other:                           250056
        total:                           3541753
    transactions:                        125022 (34.73 per sec.)
    queries:                             3541753 (983.80 per sec.)
    ignored errors:                      519    (0.14 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          3600.0604s
    total number of events:              125022

Latency (ms):
         min:                                    1.45
         avg:                                  115.18
         max:                                 4847.81
         95th percentile:                      282.25
         sum:                             14399678.87

Threads fairness:
    events (avg/stddev):           31255.5000/97.81
    execution time (avg/stddev):   3599.9197/0.02